## Analisando os dados do Titanic
### O "Hello, World!" do aspirante a analista de dados :)

Esta análise utiliza um conjunto de dados com informações sobre **891 passageiros do Titanic**. Trata-se do mesmo dataframe para testes com algoritmos de aprendizado de máquina disponível no site [Kaggle](https://www.kaggle.com/c/titanic/data).

Este trabalho é o projeto final proposto pelo módulo **Investigando uma Base de Dados** do Nanodegree **Analista de Dados** do Udacity.

### Questionamentos que tentarão ser respondidos na análise

* Quais as variáveis que mais se relacionam com a possibilidade de sobrevivência?
* Quais as diferenças nos valores das tarifas para cada classe?

In [101]:
# Importando as bibliotecas necessárias

import numpy as np
import pandas as pd

In [117]:
# Carregando o conjunto de dados

df = pd.read_csv('titanic_data.csv')
print('Número de observações:', len(df))
df.head()

Número de observações: 891

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

No site do Kaggle estão descritas as variáveis do nosso conjunto:

```
VARIABLE DESCRIPTIONS:
survival        Survival
                (0 = No; 1 = Yes)
pclass          Passenger Class
                (1 = 1st; 2 = 2nd; 3 = 3rd)
name            Name
sex             Sex
age             Age
sibsp           Number of Siblings/Spouses Aboard
parch           Number of Parents/Children Aboard
ticket          Ticket Number
fare            Passenger Fare
cabin           Cabin
embarked        Port of Embarkation
                (C = Cherbourg; Q = Queenstown; S = Southampton)
```

Como a variável `Survived` é binária (0 se morreu; 1 se sobrebiveu), o valor médio de um conjunto de valores nos dará a taxa de sobrevivência. Vamos ver a taxa média de todos os passageiros do conjunto analisado.

In [107]:
df['Survived'].mean()

0.3838383838383838

Essa taxa, no entanto, deve ser diferente por classe e sexo. Vamos investigar agrupando os dados por essas variáveis.

In [110]:
df.groupby(['Sex'])['Survived'].mean()

Sex
female    0.742038
male      0.188908
Name: Survived, dtype: float64

In [111]:
df.groupby(['Pclass'])['Survived'].mean()

Pclass
1    0.629630
2    0.472826
3    0.242363
Name: Survived, dtype: float64

In [114]:
def is_child(data):
    if pd.notnull(data):
        return data < 13
    else:
        return data
    
df['IsChild'] = df['Age'].apply(is_child)

df[df['IsChild'] == True].head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,IsChild
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S,True
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S,True
16,17,0,3,"Rice, Master. Eugene",male,2.0,4,1,382652,29.1250,NaN,Q,True
24,25,0,3,"Palsson, Miss. Torborg Danira",female,8.0,3,1,349909,21.0750,NaN,S,True
43,44,1,2,"Laroche, Miss. Simonne Marie Anne Andree",female,3.0,1,2,SC/Paris 2123,41.5792,NaN,C,True

In [115]:
df.groupby('IsChild')['Survived'].mean()

IsChild
False    0.387597
True     0.579710
Name: Survived, dtype: float64

In [120]:
df.groupby(['Pclass', 'Sex']).size()

Pclass  Sex
1       female     94
        male      122
2       female     76
        male      108
3       female    144
        male      347
dtype: int64